'use strict';

// Реалізуйте наступну систему, схожу до розглянутої на вебінарі:

// 1) чотири класи для створення об'єктів-сутностей (це можуть бути тварини, покемони, раси і т.д. - проявіть фантазію)

// 2) у кожного класу має бути мінімум 3 властивості та мінімум 3 методи(але можна й більше)

// 3) у кожного класу має бути своя унікальна властивість

// 4) у кожного класу має бути приватна властивість

// 4) у двох класів має бути спільний предок та спільний метод характерний тільки для них

// 5) у всіх чотирьох класів має бути один (крім проміжних) клас-предок




class Car {
    constructor(name, year, color) {
      this.name = name;
      this.year = year;
      this.color = color;
    }

    age = () => new Date().getFullYear() - year;
    showDescription = console.log('The car is  years old');
}


const myCar1 = new Car("Ford", 2014, 'grey');

console.log(myCar1);
    